In [25]:
import pandas as pd
import numpy as np

MAP() — Element wise replace / transform

In [26]:
df = pd.DataFrame({
    "Name": ["Arman","Riya","Kunal"],
    "DeptCode": [1,2,1],
    "Salary": [98000,55000,67000]
})

dept_map = {
    1: "IT",
    2: "HR"
}

df["Department"] = df["DeptCode"].map(dept_map)
df

    Name  DeptCode  Salary Department
0  Arman         1   98000         IT
1   Riya         2   55000         HR
2  Kunal         1   67000         IT

APPLY() — Custom logic (Power tool)

In [27]:
# Column apply
df["Bonus"] = df["Salary"].apply(lambda x: x*0.10)
df

    Name  DeptCode  Salary Department   Bonus
0  Arman         1   98000         IT  9800.0
1   Riya         2   55000         HR  5500.0
2  Kunal         1   67000         IT  6700.0

In [28]:
# Function + Apply
def level(Salary):
    if Salary > 60000:
        return "High"
    else:
        return "Normal"

df["Level"] = df["Salary"].apply(level)

#another method using lambda
df["post"] = df["Salary"].apply(lambda x: "Senior" if x>60000  else "Junior")

In [29]:
df

    Name  DeptCode  Salary Department   Bonus   Level    post
0  Arman         1   98000         IT  9800.0    High  Senior
1   Riya         2   55000         HR  5500.0  Normal  Junior
2  Kunal         1   67000         IT  6700.0    High  Senior

In [30]:
# row wise apply
df["Tax"] = df.apply(lambda row : row["Salary"] * 0.05 if row["Department"] == "IT" else row["Salary"] * 0.03, axis=1)
df

    Name  DeptCode  Salary Department   Bonus   Level    post     Tax
0  Arman         1   98000         IT  9800.0    High  Senior  4900.0
1   Riya         2   55000         HR  5500.0  Normal  Junior  1650.0
2  Kunal         1   67000         IT  6700.0    High  Senior  3350.0

In [31]:
# LAMBDA — Short function
df["Salary"] = df["Salary"].apply(lambda x: x+5000)

In [32]:
df

    Name  DeptCode  Salary Department   Bonus   Level    post     Tax
0  Arman         1  103000         IT  9800.0    High  Senior  4900.0
1   Riya         2   60000         HR  5500.0  Normal  Junior  1650.0
2  Kunal         1   72000         IT  6700.0    High  Senior  3350.0